; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f21-p19-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 p17 p18 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 f12 f13 f14 f15 f16 f17 f18 f19 
             f20 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)
(above f0 f12)
(above f0 f13)
(above f0 f14)
(above f0 f15)
(above f0 f16)
(above f0 f17)
(above f0 f18)
(above f0 f19)
(above f0 f20)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)
(above f1 f12)
(above f1 f13)
(above f1 f14)
(above f1 f15)
(above f1 f16)
(above f1 f17)
(above f1 f18)
(above f1 f19)
(above f1 f20)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)
(above f2 f12)
(above f2 f13)
(above f2 f14)
(above f2 f15)
(above f2 f16)
(above f2 f17)
(above f2 f18)
(above f2 f19)
(above f2 f20)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)
(above f3 f12)
(above f3 f13)
(above f3 f14)
(above f3 f15)
(above f3 f16)
(above f3 f17)
(above f3 f18)
(above f3 f19)
(above f3 f20)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)
(above f4 f12)
(above f4 f13)
(above f4 f14)
(above f4 f15)
(above f4 f16)
(above f4 f17)
(above f4 f18)
(above f4 f19)
(above f4 f20)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)
(above f5 f12)
(above f5 f13)
(above f5 f14)
(above f5 f15)
(above f5 f16)
(above f5 f17)
(above f5 f18)
(above f5 f19)
(above f5 f20)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)
(above f6 f12)
(above f6 f13)
(above f6 f14)
(above f6 f15)
(above f6 f16)
(above f6 f17)
(above f6 f18)
(above f6 f19)
(above f6 f20)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)
(above f7 f12)
(above f7 f13)
(above f7 f14)
(above f7 f15)
(above f7 f16)
(above f7 f17)
(above f7 f18)
(above f7 f19)
(above f7 f20)

(above f8 f9)
(above f8 f10)
(above f8 f11)
(above f8 f12)
(above f8 f13)
(above f8 f14)
(above f8 f15)
(above f8 f16)
(above f8 f17)
(above f8 f18)
(above f8 f19)
(above f8 f20)

(above f9 f10)
(above f9 f11)
(above f9 f12)
(above f9 f13)
(above f9 f14)
(above f9 f15)
(above f9 f16)
(above f9 f17)
(above f9 f18)
(above f9 f19)
(above f9 f20)

(above f10 f11)
(above f10 f12)
(above f10 f13)
(above f10 f14)
(above f10 f15)
(above f10 f16)
(above f10 f17)
(above f10 f18)
(above f10 f19)
(above f10 f20)

(above f11 f12)
(above f11 f13)
(above f11 f14)
(above f11 f15)
(above f11 f16)
(above f11 f17)
(above f11 f18)
(above f11 f19)
(above f11 f20)

(above f12 f13)
(above f12 f14)
(above f12 f15)
(above f12 f16)
(above f12 f17)
(above f12 f18)
(above f12 f19)
(above f12 f20)

(above f13 f14)
(above f13 f15)
(above f13 f16)
(above f13 f17)
(above f13 f18)
(above f13 f19)
(above f13 f20)

(above f14 f15)
(above f14 f16)
(above f14 f17)
(above f14 f18)
(above f14 f19)
(above f14 f20)

(above f15 f16)
(above f15 f17)
(above f15 f18)
(above f15 f19)
(above f15 f20)

(above f16 f17)
(above f16 f18)
(above f16 f19)
(above f16 f20)

(above f17 f18)
(above f17 f19)
(above f17 f20)

(above f18 f19)
(above f18 f20)

(above f19 f20)



(origin p0 f3)
(destin p0 f19)

(origin p1 f3)
(destin p1 f1)

(origin p2 f4)
(destin p2 f19)

(origin p3 f7)
(destin p3 f5)

(origin p4 f3)
(destin p4 f11)

(origin p5 f6)
(destin p5 f13)

(origin p6 f5)
(destin p6 f19)

(origin p7 f14)
(destin p7 f19)

(origin p8 f7)
(destin p8 f15)

(origin p9 f10)
(destin p9 f15)

(origin p10 f0)
(destin p10 f3)

(origin p11 f8)
(destin p11 f4)

(origin p12 f8)
(destin p12 f4)

(origin p13 f0)
(destin p13 f14)

(origin p14 f18)
(destin p14 f14)

(origin p15 f4)
(destin p15 f20)

(origin p16 f10)
(destin p16 f7)

(origin p17 f0)
(destin p17 f12)

(origin p18 f6)
(destin p18 f7)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
(served p17)
(served p18)
))
)

; plan
1. (board f0 p17)
   added: (boarded p17)
   goals met: 0 of 19
2. (board f0 p13)
   added: (boarded p13)
   goals met: 0 of 19
3. (board f0 p10)
   added: (boarded p10)
   goals met: 0 of 19
4. (up f0 f3)
   deleted: (lift-at f0)
   added: (lift-at f3)
   goals met: 0 of 19
5. (depart f3 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 1 of 19
6. (board f3 p4)
   added: (boarded p4)
   goals met: 1 of 19
7. (board f3 p1)
   added: (boarded p1)
   goals met: 1 of 19
8. (board f3 p0)
   added: (boarded p0)
   goals met: 1 of 19
9. (up f3 f18)
   deleted: (lift-at f3)
   added: (lift-at f18)
   goals met: 1 of 19
10. (board f18 p14)
   added: (boarded p14)
   goals met: 1 of 19
11. (down f18 f12)
   deleted: (lift-at f18)
   added: (lift-at f12)
   goals met: 1 of 19
12. (depart f12 p17)
   deleted: (boarded p17)
   added: (served p17)
   goals met: 2 of 19
13. (down f12 f11)
   deleted: (lift-at f12)
   added: (lift-at f11)
   goals met: 2 of 19
14. (depart f11 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 3 of 19
15. (down f11 f10)
   deleted: (lift-at f11)
   added: (lift-at f10)
   goals met: 3 of 19
16. (board f10 p9)
   added: (boarded p9)
   goals met: 3 of 19
17. (board f10 p16)
   added: (boarded p16)
   goals met: 3 of 19
18. (down f10 f1)
   deleted: (lift-at f10)
   added: (lift-at f1)
   goals met: 3 of 19
19. (depart f1 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 4 of 19
20. (up f1 f14)
   deleted: (lift-at f1)
   added: (lift-at f14)
   goals met: 4 of 19
21. (board f14 p7)
   added: (boarded p7)
   goals met: 4 of 19
22. (depart f14 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 5 of 19
23. (depart f14 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 6 of 19
24. (down f14 f6)
   deleted: (lift-at f14)
   added: (lift-at f6)
   goals met: 6 of 19
25. (board f6 p18)
   added: (boarded p18)
   goals met: 6 of 19
26. (board f6 p5)
   added: (boarded p5)
   goals met: 6 of 19
27. (up f6 f13)
   deleted: (lift-at f6)
   added: (lift-at f13)
   goals met: 6 of 19
28. (depart f13 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 7 of 19
29. (down f13 f7)
   deleted: (lift-at f13)
   added: (lift-at f7)
   goals met: 7 of 19
30. (board f7 p3)
   added: (boarded p3)
   goals met: 7 of 19
31. (board f7 p8)
   added: (boarded p8)
   goals met: 7 of 19
32. (depart f7 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 8 of 19
33. (depart f7 p18)
   deleted: (boarded p18)
   added: (served p18)
   goals met: 9 of 19
34. (down f7 f5)
   deleted: (lift-at f7)
   added: (lift-at f5)
   goals met: 9 of 19
35. (board f5 p6)
   added: (boarded p6)
   goals met: 9 of 19
36. (depart f5 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 10 of 19
37. (up f5 f15)
   deleted: (lift-at f5)
   added: (lift-at f15)
   goals met: 10 of 19
38. (depart f15 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 11 of 19
39. (depart f15 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 12 of 19
40. (down f15 f8)
   deleted: (lift-at f15)
   added: (lift-at f8)
   goals met: 12 of 19
41. (board f8 p11)
   added: (boarded p11)
   goals met: 12 of 19
42. (board f8 p12)
   added: (boarded p12)
   goals met: 12 of 19
43. (down f8 f4)
   deleted: (lift-at f8)
   added: (lift-at f4)
   goals met: 12 of 19
44. (board f4 p15)
   added: (boarded p15)
   goals met: 12 of 19
45. (board f4 p2)
   added: (boarded p2)
   goals met: 12 of 19
46. (depart f4 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 13 of 19
47. (depart f4 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 14 of 19
48. (up f4 f19)
   deleted: (lift-at f4)
   added: (lift-at f19)
   goals met: 14 of 19
49. (depart f19 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 15 of 19
50. (depart f19 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 16 of 19
51. (depart f19 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 17 of 19
52. (depart f19 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 18 of 19
53. (up f19 f20)
   deleted: (lift-at f19)
   added: (lift-at f20)
   goals met: 18 of 19
54. (depart f20 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 19 of 19
